export default [
  {
    url: "/api/workflow/GetBasic",
    method: "get",
    response: () => {
      return {
        ClientFuntionList: { 合同管理: ["合同审批前验证"], 预算支付: ["预算支付提交前"], 预算申请: ["预算申请提交前"], 预算管理: ["预算验证提交前", "预算验证提交前带明细"] },
        CompanyList: [{ name: "测试单位", id: "100000000" }],
        WorkFlowRelationList: [{ name: "分管领导", id: "100000000" }, { name: "物资审核员", id: "100000002" }, { name: "部门负责人", id: "100000001" }],
        DocTypeAndWindow: { 出差报销GOV: "出差报销", 公务用车申请: "公务用车申请", 合同审批: "合同审批", 合同履约: "合同履约", 接待报销: "接待报销", 其他付款: "其他付款", 印刷费申请: "印刷费申请", 集中付款: "集中付款", 委托招标采购: "委托招标采购", 办公用品购置申请: "办公用品购置申请", 预算调整: "预算调整", 出差申请GOV: "出差申请", 接待申请: "接待申请", 培训费申请: "培训费申请", 其他支出申请: "其他支出申请", 预算下达: "预算下达", 公车运行维护申请: "公车运行维护申请", 资产调拨: "资产调拨", 项目建议书: "项目建议书", 初步设计管理事项: "初步设计管理事项", 可行性研究事项: "可行性研究事项", "因公临时出国(境)申请": "因公临时出国(境)申请", "因公临时出国(境)报销": "因公临时出国(境)报销", 单位自行采购: "单位自行采购", 合同续签: "合同续签", 合同终结: "合同终结", 收文处理: "收文处理", 发文处理: "发文处理", 请假销假申请: "请假销假申请", 日常维修申请: "日常维修申请", 日常维修报销: "日常维修报销", 会议费报销1: "会议费报销", 培训费报销: "培训费报销", 分期付款: "分期付款", 费用预申报: "费用预申报", 采购申请: "采购申请", 采购报销: "采购报销", 物资采购计划编制: "物资采购计划编制", 物资购置申请: "物资购置申请", 物资领用出库: "物资领用出库", 物资入库申请: "物资入库申请", 物资验收申请: "物资验收申请", 物资付款申请: "物资付款申请", 资产验收入库: "资产验收入库", 资产领用申请: "资产领用申请", 资产变动申请: "资产变动申请", 资产盘点计划管理: "资产盘点计划管理", 资产维修保养申请: "资产维修保养申请", 资产维修保养报销: "资产维修保养报销", 资产处置申请: "资产处置申请", 物资信息变动申请: "物资信息变动申请", 物资购置核减: "物资购置核减", 专家劳务费申请: "专家劳务费申请", 专家劳务费报销: "专家劳务费报销", 加班误餐补助申请: "加班误餐补助申请", 加班误餐补助报销: "加班误餐补助报销", 经费支出申请: "经费支出申请", 经费支出报销: "经费支出报销", 年中预算编报: "年中预算编报", 加班审批: "加班审批", 薪资变动: "薪资变动", 中心实验室使用审批: "中心实验室使用审批", 预算编报一上: "预算编报一上", 预算编报一下: "预算编报一下", 预算编报二上: "预算编报二上", 预算编报二下: "预算编报二下", 年中预算调整: "年中预算调整", 配套资金下达及分解: "配套资金下达及分解", 年支出预算下达: "年支出预算下达", 科研经费申请: "科研经费申请", 论文管理: "论文管理", 课题资金到账及分解: "课题资金到账及分解", 预算资金到账及拆分: "预算资金到账及拆分", 课题新增维护: "课题新增维护", 规培补助分配: "规培补助分配", 科研经费报销: "科研经费报销", 国内外公务学术与培训申请: "国内外公务学术与培训申请", 国内外公务学术与培训报销: "国内外公务学术与培训报销", 会议费申请: "办会费申请", 会议费报销: "办会费报销", 其他劳务报销: "其他劳务报销", 咨询费报销: "咨询费报销", 托儿费报销: "托儿费报销", 人员外出进修申请: "人员外出进修申请", 人员外出进修报销: "人员外出进修报销", 宣传费申请: "宣传费申请", 宣传费报销: "宣传费报销", 设备付款申请: "设备付款申请", 基建项目付款申请: "基建项目付款申请", 借款申请: "借款申请", 药品材料设备批量付款: "药品材料设备批量付款", 还款申请: "还款申请", 夜班费申报: "夜班费申报", 夜班费汇总报销: "夜班费汇总报销", 预算项目申报: "预算项目申报", 配套资金批量下达: "配套资金批量下达", 医疗设备购置论证: "医疗设备购置论证", 预算编报一上汇总提报: "预算编报一上汇总提报", 政府采购预算编报: "政府采购预算编报", 支出预算一下批复意见: "支出预算一下批复意见", 新增资产配置预算: "新增资产配置预算", 预算编报二下反馈: "预算编报二下反馈", 预算结转: "预算结转", 合同变更补充修订: "合同变更补充修订", 科研配套奖励资金下达: "科研配套奖励资金下达", 供应商信息变更: "供应商信息变更", 托儿费申请: "托儿费申请", 非支出事项申请: "非支出事项申请", 代课教师酬金发放申请: "代课教师酬金发放申请", 代课教师酬金发放报销: "代课教师酬金发放报销", 印刷费报销: "印刷费报销", 办公用品购置报销: "办公用品购置报销", 公车运行维护报销: "公车运行维护报销", 公务用车报销: "公务用车报销", 往来款资金事项申请: "往来款资金事项申请", 往来款资金事项报销: "往来款资金事项报销" },
        NodeUserDesList: ["科室主任", "分管业务领导", "分管财务领导", "财务主任", "主要领导", "出纳", "财务初审", "办公室主任", "业务部门负责人", "归口管理部门"],
        SLDutyType: 3,
        SLIcon: "ics",
        SLTitle: "内控流程体系-业务流程图",
        ServerFunctionList: { 采购管理: ["采购申请作废"], 合同管理: ["合同续签", "合同存档编号", "合同终结", "合同履约台账写入", "合同变更预算验证", "供应商信息变更", "合同履约条款金额扣除", "合同审批重冻结前验证", "合同台账写入", "合同续签单据处理", "合同修订变更补充处理"], 课题管理: ["写入预算项目维护_001课题", "课题负责人消息提示"], 物资管理: ["物资验收申请台账写入", "更新物资购置申请台账状态（减少核减数量）", "更新物资购置申请台账状态（增加核减数量）", "物资购置申请作废台账写入", "更新物资信息库存状态（修改库存状态核减）", "更新物资验收申请台账状态（归还入库状态）", "更新物资验收申请台账状态（修改入库状态）", "更新物资信息库存状态（归还库存状态核加）", "物资库存预警检测和发送告警消息", "更新物资购置申请台账状态（减少验收数量）", "物资采购计划台账写入", "物资购置申请台账写入", "计算物资领用出库总价", "更新物资购置申请台账状态（增加验收数量）"], 系统集成: ["政府会计发送数据"], 项目管理: ["项目台帐写入"], 预算管理: ["预算调整后在途单据数据", "计算课题的已报销金额", "配套资金批量下达预算写入", "增改项目同步到项目对照库_一上", "预算调整验证政府采购及信息", "增改项目同步到项目对照库_二上", "自动生成政府采购预算信息", "科研外拨资金拆分发消息给财务", "预算调整中间节点金额验证", "未提交单据预算预验证", "预算调整执行2", "预算调整判断是否勾选政府采购", "一次性预算项目资金回池", "招标采购申请预算重冻结2", "预算调整", "预算申请扣减2_程序", "申报项目写入项目对照库", "年度预算结转", "融合预算调整提交前预验证", "科研配套奖励经费下达", "年度预算下达", "合同审批预算重冻结2", "预算到账通知", "采购计划预算调整处理"], 预算申请: ["预算申请返还", "预算申请扣减2", "预算申请提交前2", "预算申请作废", "预算申请返还2", "预算申请扣减", "预算申请提交前", "预算验证提交前通用"], 预算申请支付: ["预算申请支付扣减", "预算申请支付作废", "预算申请支付返还"], 预算下达: ["写入外拨资金明细", "预算资金到账拆分_拆分时验证", "预算资金到账拆分_写入台账", "预算下达_配套资金到账分解", "预算下达_年度预算下达2", "预算下达_课题资金到账分解", "写入预算项目维护_预算下达_002规培", "写入配套资金明细", "写入下拨资金记录"], 预算支付: ["预算支付扣减", "预算申请支付扣减2", "预算申请支付提交验证2", "预算支付返还", "预算支付作废", "预算支付提交前"], 支出管理: ["分期付款台账写入", "金额信息验证", "写入借款申请台账", "事前申请台账写入", "更新借款申请台账"], 资产管理: ["更新资产变动信息", "更新资产出库状态信息", "资产盘点计划台账写入", "资产调拨更新", "更新资产累计折旧值（按月计算，直线法）", "更新资产处置状态", "资产验收入库台账写入", "资产维修申请台账写入", "更新资产维修申请台账"] },
        WorkFlowNoteList: [{ NoteName: "财务预算审核", NoteCode: "001", ID: 100000000 }, { OrgCode_xID: 100000000, OrgName: "临沂市技师学院", NoteName: "财务票据审核", OrgCode: "001", NoteCode: "002", ID: 1000000011 }, { OrgCode_xID: 100000000, OrgName: "临沂市技师学院", NoteName: "分管财务院长", OrgCode: "001", NoteCode: "004", ID: 1000000061 }, { OrgCode_xID: 100000000, OrgName: "临沂市技师学院", NoteName: "财务负责人", OrgCode: "001", NoteCode: "007", ID: 1000000071 }, { NoteName: "院长", NoteCode: "0001", ID: 1000000161 }, { NoteName: "处室（系部）负责人", NoteCode: "01", ID: 1000000171 }, { NoteName: "分管院领导", NoteCode: "02", ID: 1000000181 }, { NoteName: "党委院长办公室用印", NoteCode: "03", ID: 1000000471 }, { NoteName: "纪委监察查审核", NoteCode: "04", ID: 1000000481 }, { NoteName: "资料入档审核", NoteCode: "05", ID: 1000000491 }, { NoteName: "党委（院长）办公室负责人", NoteCode: "06", ID: 1000000501 }, { NoteName: "工会负责人", NoteCode: "008", ID: 1000000511 }, { NoteName: "业务单据合规检查", NoteCode: "009", ID: 1000000521 }, { NoteName: "系部（教学管理）分管院长", NoteCode: "010", ID: 1000000531 }, { NoteName: "系部（学生管理）分管院长", NoteCode: "011", ID: 1000000541 }, { NoteName: "教务处审核", NoteCode: "012", ID: 1000000551 }, { NoteName: "人事处审核", NoteCode: "013", ID: 1000000561 }],

      };
    },
  },
  {
    url: "/api/workflow/GetWorkFlowInfo",
    method: "post",
    response: () => {
      return {};
    },
  },
  {
    url: "/api/workflow/GetUserList",
    method: "post",
    response: () => {
      return {
        total: 3007,
        list: [
          { UserID: "100000001", UserCode: "0125", UserName: "邓**", Company: "山东省***", OrgName: "消化内科一病区" },
          { UserID: "100000002", UserCode: "0200", UserName: "高**", Company: "山东省***", OrgName: "消化内科一病区" },
          { UserID: "100000003", UserCode: "0267", UserName: "韩**", Company: "山东省***", OrgName: "骨软与血管外介入病区" },
          { UserID: "100000004", UserCode: "0341", UserName: "黄**", Company: "山东省***", OrgName: "消化内科三病区" },
          { UserID: "100000005", UserCode: "0555", UserName: "李**", Company: "山东省***", OrgName: "消化内科一病区" },
          { UserID: "100000006", UserCode: "0624", UserName: "刘**", Company: "山东省***", OrgName: "骨软与血管外介入病区" },
          { UserID: "100000007", UserCode: "0828", UserName: "庞**", Company: "山东省***", OrgName: "消化内科一病区" },
          { UserID: "100000008", UserCode: "1004", UserName: "谭**", Company: "山东省***", OrgName: "消化内科一病区" },
          { UserID: "100000009", UserCode: "1082", UserName: "王**", Company: "山东省***", OrgName: "消化内科一病区" },
          { UserID: "100000010", UserCode: "1289", UserName: "徐**", Company: "山东省***", OrgName: "消化内科一病区" },
          { UserID: "100000011", UserCode: "1434", UserName: "于**", Company: "山东省***", OrgName: "消化内科二病区" },
          { UserID: "100000012", UserCode: "1628", UserName: "赵**", Company: "山东省***", OrgName: "消化内科一病区" },
          { UserID: "100000013", UserCode: "1780", UserName: "徐**", Company: "山东省***", OrgName: "骨软与血管外介入病区" },
          { UserID: "100000014", UserCode: "1795", UserName: "谭**", Company: "山东省***", OrgName: "消化内科一病区" },
          { UserID: "100000015", UserCode: "1834", UserName: "王**", Company: "山东省***", OrgName: "消化内科一病区" },
          { UserID: "100000016", UserCode: "1838", UserName: "徐**", Company: "山东省***", OrgName: "中西医结合病区" },
          { UserID: "100000017", UserCode: "1936", UserName: "张**", Company: "山东省***", OrgName: "消化内科一病区" },
          { UserID: "100000018", UserCode: "1974", UserName: "韩**", Company: "山东省***", OrgName: "消化内科一病区" },
          { UserID: "100000019", UserCode: "2300", UserName: "赵**", Company: "山东省***", OrgName: "胸外科二病区" }],
      };
    },
  },
  {
    url: "/api/workflow/GetCheckFactorList",
    method: "post",
    response: () => {
      return ["出差报销-单据编号", "出差报销-单据日期", "出差报销-报销人", "出差报销-部门名称", "出差报销-单位名称", "出差报销-是否科研经费", "出差报销-报销人编号", "出差报销-部门编号", "出差报销-单位编号", "出差报销-报销金额", "出差报销-金额大写", "出差报销-附件张数", "出差报销-备注", "出差报销-申请单号", "出差报销-查看事前申请", "出差报销-申请日期", "出差报销-申请人", "出差报销-申请部门", "出差报销-申请金额", "出差报销-申请事由", "出差报销-行程信息", "出差报销-市内行程数", "出差报销-省内行程数", "出差报销-省外行程数", "出差报销-结算信息", "行程信息-出发日期", "行程信息-出发地区", "行程信息-出发城市", "行程信息-到达日期", "行程信息-到达地区", "行程信息-到达城市", "行程信息-交通工具", "行程信息-出差人员", "行程信息-交通工具编号", "行程信息-地区编号", "行程信息-到达地区编号", "行程信息-伙食补助标准", "行程信息-交通补助标准", "行程信息-人员信息", "本单位报销人员信息-姓名", "本单位报销人员信息-部门名称", "本单位报销人员信息-职级", "本单位报销人员信息-城市间交通费", "本单位报销人员信息-双人合住标间", "本单位报销人员信息-住宿标准", "本单位报销人员信息-住宿费", "本单位报销人员信息-住宿天数", "本单位报销人员信息-伙食补助标准", "本单位报销人员信息-伙食补助天数", "本单位报销人员信息-伙食补助费", "本单位报销人员信息-市内交通补助标准", "本单位报销人员信息-市内交通补助天数", "本单位报销人员信息-交通补助费", "本单位报销人员信息-其他费用", "本单位报销人员信息-合计金额", "本单位报销人员信息-行政级别编号", "外部报销人员信息-姓名", "外部报销人员信息-单位/部门", "外部报销人员信息-职级", "外部报销人员信息-城市间交通费", "外部报销人员信息-双人合住标间", "外部报销人员信息-住宿标准", "外部报销人员信息-住宿费", "外部报销人员信息-住宿天数", "外部报销人员信息-伙食补助标准", "外部报销人员信息-伙食补助天数", "外部报销人员信息-伙食补助费", "外部报销人员信息-市内交通补助标准", "外部报销人员信息-市内交通补助天数", "外部报销人员信息-交通补助费", "外部报销人员信息-其他费用", "外部报销人员信息-合计金额", "外部报销人员信息-行政级别编号", "公务卡结算-姓名", "公务卡结算-公务卡号", "公务卡结算-结算金额", "其他结算-结算方式", "其他结算-收款人", "其他结算-开户银行", "其他结算-银行账号", "其他结算-结算金额", "其他结算-结算方式编号"];
    },
  },
  {
    url: "/api/workflow/GetCheckOperationPurviewList",
    method: "post",
    response: () => {
      return ["行程信息", "本单位报销人员信息", "外部报销人员信息", "公务卡结算", "其他结算"];
    },
  },
  {
    url: "/api/workflow/SaveWorkFlow",
    method: "post",
    response: () => {
      return { Code: "S", $code: "S", Success: true, $msg: "", Message: "", Result: null, $result: null };
    },
  },
];
