export default [
  {
    url: "/api/workflow/GetBasic",
    method: "get",
    response: () => {
      return {
        ClientFuntionList: { 合同管理: ["合同审批前验证"], 预算支付: ["预算支付提交前"], 预算申请: ["预算申请提交前"], 预算管理: ["预算验证提交前", "预算验证提交前带明细"] },
        DicCompanyList: { 测试单位: "100000000" },
        DicWorkFlowNoteList: { 主管部门: "100000001", 业务部门: "100000002", 人力资源部: "100000003", 内部审计部: "100000004", 分管业务领导: "100000005", 后勤保障部: "100000006", 总会计师: "100000007", 归口部门: "100000008", "财务部门:": "100000009", "院务部:": "1000000010", "上级主管部门:": "1000000011" },
        DicWorkFlowRelationList: { 内部审计部主任: "100000003", 分管领导: "100000000", 物资审核员: "100000002", 部门负责人: "100000001" },
        DocTypeAndWindowList: [{ doctype: "出差报销GOV", sheetname: "出差报销", windows: ["出差报销", "行程信息", "公务卡结算", "其他结算", "本单位报销人员信息", "外部报销人员信息"] }, { doctype: "会议费申请1", sheetname: "会议费申请", windows: ["会议费申请"] }, { doctype: "公务用车申请", sheetname: "公务用车申请", windows: ["公务用车申请", "自有车信息", "租车信息"] }, { doctype: "合同审批", sheetname: "合同审批", windows: ["合同审批", "预算信息", "履约控制", "采购申请明细", "耗材或试剂明细", "后勤产品明细", "采购申请预算明细"] }, { doctype: "合同履约", sheetname: "合同履约", windows: ["合同履约", "合同履约历史", "申请明细"] }, { doctype: "接待报销", sheetname: "接待报销", windows: ["接待报销", "来宾人员信息", "陪同人员信息", "公务活动项目", "用车事前申请"] }, { doctype: "其他付款", sheetname: "其他付款", windows: ["其他付款"] }, { doctype: "印刷费申请", sheetname: "印刷费申请", windows: ["印刷费申请", "印刷信息"] }, { doctype: "集中付款", sheetname: "集中付款", windows: ["集中付款", "付款明细"] }, { doctype: "委托招标采购", sheetname: "委托招标采购", windows: ["委托招标采购", "委托招标采购明细"] }, { doctype: "办公用品购置申请", sheetname: "办公用品购置申请", windows: ["办公用品购置申请", "办公用品购置明细"] }, { doctype: "预算调整", sheetname: "预算调整", windows: ["基本信息", "追加预算", "调整预算", "调减预算明细", "调加预算明细"] }, { doctype: "出差申请GOV", sheetname: "出差申请", windows: ["出差申请", "行程信息", "本单位出差人员信息", "外部出差人员信息"] }, { doctype: "接待申请", sheetname: "接待申请", windows: ["接待申请", "来宾人员信息", "陪同人员信息"] }, { doctype: "培训费申请", sheetname: "培训费申请", windows: ["培训费申请", "综合费用信息", "师资费用信息"] }, { doctype: "其他支出申请", sheetname: "其他支出申请", windows: ["其他支出申请"] }, { doctype: "预算下达", sheetname: "预算下达", windows: ["预算下达", "预算下达明细"] }, { doctype: "公车运行维护申请", sheetname: "公车运行维护申请", windows: ["公车运行维护申请", "车辆维修信息", "车辆保养信息", "加油卡充值信息"] }, { doctype: "资产调拨", sheetname: "资产调拨", windows: ["资产调拨", "资产调拨明细"] }, { doctype: "项目建议书", sheetname: "项目建议书", windows: ["项目建议书"] }, { doctype: "初步设计管理事项", sheetname: "初步设计管理事项", windows: ["初步设计管理事项"] }, { doctype: "可行性研究事项", sheetname: "可行性研究事项", windows: ["可行性研究事项"] }, { doctype: "因公临时出国(境)申请", sheetname: "因公临时出国(境)申请", windows: ["因公临时出国(境)申请"] }, { doctype: "因公临时出国(境)报销", sheetname: "因公临时出国(境)报销", windows: ["因公临时出国(境)报销", "公务卡结算", "其他结算"] }, { doctype: "单位自行采购", sheetname: "单位自行采购", windows: ["单位自行采购", "单位自行采购明细"] }, { doctype: "合同续签", sheetname: "合同续签", windows: ["合同续签", "履约条款信息", "续签历史", "批量续签合同"] }, { doctype: "合同终结", sheetname: "合同终结", windows: ["合同终结", "合同履约历史"] }, { doctype: "收文处理", sheetname: "收文处理", windows: ["收文处理"] }, { doctype: "发文处理", sheetname: "发文处理", windows: ["发文处理"] }, { doctype: "请假销假申请", sheetname: "请假销假申请", windows: ["请假销假申请"] }, { doctype: "日常维修申请", sheetname: "日常维修申请", windows: ["日常维修申请", "维修明细"] }, { doctype: "日常维修报销", sheetname: "日常维修报销", windows: ["日常维修报销", "维修明细"] }, { doctype: "会议费报销1", sheetname: "会议费报销", windows: ["会议费报销", "公务卡结算", "其他结算"] }, { doctype: "培训费报销", sheetname: "培训费报销", windows: ["培训费报销", "培训综合费用信息", "培训师资费用信息"] }, { doctype: "分期付款", sheetname: "分期付款", windows: ["分期付款", "付款历史", "公务卡结算", "其他结算"] }, { doctype: "费用预申报", sheetname: "费用预申报", windows: ["费用预申报"] }, { doctype: "采购申请", sheetname: "采购申请", windows: ["采购申请", "预算追加信息", "预算调减信息", "采购申请明细", "供应商信息"] }, { doctype: "采购报销", sheetname: "采购报销", windows: ["采购报销", "采购明细"] }, { doctype: "物资采购计划编制", sheetname: "物资采购计划编制", windows: ["物资采购计划编制", "采购计划明细"] }, { doctype: "物资购置申请", sheetname: "物资购置申请", windows: ["物购置申请", "物资购置申请明细"] }, { doctype: "物资领用出库", sheetname: "物资领用出库", windows: ["物资领用出库", "物资领用明细"] }, { doctype: "物资入库申请", sheetname: "物资入库申请", windows: ["物资入库申请", "物资入库明细"] }, { doctype: "物资验收申请", sheetname: "物资验收申请", windows: ["物资验收申请", "物资验收申请明细"] }, { doctype: "物资付款申请", sheetname: "物资付款申请", windows: ["物资付款申请", "物资付款申请明细"] }, { doctype: "资产验收入库", sheetname: "资产验收入库", windows: ["资产验收入库", "验收入库明细"] }, { doctype: "资产领用申请", sheetname: "资产领用申请", windows: ["资产领用申请", "资产领用明细"] }, { doctype: "资产变动申请", sheetname: "资产变动申请", windows: ["资产变动申请", "变动资产", "资产变动类型"] }, { doctype: "资产盘点计划管理", sheetname: "资产盘点计划管理", windows: ["资产盘点计划管理", "类别盘点计划明细", "部门盘点计划明细"] }, { doctype: "资产维修保养申请", sheetname: "资产维修保养申请", windows: ["资产维修申请"] }, { doctype: "资产维修保养报销", sheetname: "资产维修保养报销", windows: ["资产维修报销", "公务卡结算", "其他结算"] }, { doctype: "资产处置申请", sheetname: "资产处置申请", windows: ["资产处置申请", "资产处置明细"] }, { doctype: "物资信息变动申请", sheetname: "物资信息变动申请", windows: ["物资信息变动申请", "物资信息变动明细"] }, { doctype: "物资购置核减", sheetname: "物资购置核减", windows: ["物资购置核减", "物资购置核减明细"] }, { doctype: "专家劳务费申请", sheetname: "专家劳务费申请", windows: ["专家劳务费申请"] }, { doctype: "专家劳务费报销", sheetname: "专家劳务费报销", windows: ["专家劳务费报销", "专家劳务费报销明细"] }, { doctype: "加班误餐补助申请", sheetname: "加班误餐补助申请", windows: ["加班误餐补助申请", "加班人信息"] }, { doctype: "加班误餐补助报销", sheetname: "加班误餐补助报销", windows: ["加班误餐补助报销", "报销明细", "公务卡结算", "其他结算"] }, { doctype: "经费支出申请", sheetname: "经费支出申请", windows: ["基本信息", "经费预算明细"] }, { doctype: "经费支出报销", sheetname: "经费支出报销", windows: ["基本信息", "申请及报销信息", "报销信息"] }, { doctype: "年中预算编报", sheetname: "年中预算编报", windows: ["基本信息", "编报明细"] }, { doctype: "加班审批", sheetname: "加班审批", windows: ["基本信息", "加班人信息"] }, { doctype: "薪资变动", sheetname: "薪资变动", windows: ["薪资变动"] }, { doctype: "中心实验室使用审批", sheetname: "中心实验室使用审批", windows: ["基本信息"] }, { doctype: "预算编报一上", sheetname: "预算编报一上", windows: ["预算编报一上", "预算编报一上明细", "预算编报一上绩效明细", "分年度支出计划表", "项目概况及申报依据"] }, { doctype: "预算编报一下", sheetname: "预算编报一下", windows: ["预算编报一下", "预算编报一下明细", "允许新增项目依据"] }, { doctype: "预算编报二上", sheetname: "预算编报二上", windows: ["预算编报二上", "预算编报二上明细", "一下驳回数据", "政府采购信息"] }, { doctype: "预算编报二下", sheetname: "预算编报二下", windows: ["预算编报二下", "预算编报二下明细", "预算二下编报政府采购明细"] }, { doctype: "年中预算调整", sheetname: "年中预算调整", windows: ["年中预算调整", "年中预算编报明细"] }, { doctype: "配套资金下达及分解", sheetname: "配套资金下达及分解", windows: ["批复信息", "分解明细"] }, { doctype: "年支出预算下达", sheetname: "年支出预算下达", windows: ["基本信息", "下达明细"] }, { doctype: "科研经费申请", sheetname: "科研经费申请", windows: ["基本信息", "出差行程及人员信息", "综合费用信息", "师资费用信息", "国际合作与交流人员行程信息"] }, { doctype: "论文管理", sheetname: "论文管理", windows: ["基本信息"] }, { doctype: "课题资金到账及分解", sheetname: "课题资金到账及分解", windows: ["基本信息", "项目支出分解明细"] }, { doctype: "预算资金到账及拆分", sheetname: "预算资金到账及拆分", windows: ["到账信息", "科研资金拆分明细"] }, { doctype: "课题新增维护", sheetname: "课题新增维护", windows: ["基本信息", "预算分解信息"] }, { doctype: "规培补助分配", sheetname: "规培补助分配", windows: ["基本信息", "分配名单"] }, { doctype: "科研经费报销", sheetname: "科研经费报销", windows: ["基本信息", "差旅费报销信息", "综合费用", "师资费用", "劳务费报销明细", "材料费明细", "咨询费报销个人明细", "咨询费报销单位明细", "版面费明细", "绩效费明细", "测试费明细", "设备费明细", "国外费用", "国际合作与交流国内差旅信息"] }, { doctype: "国内外公务学术与培训申请", sheetname: "国内外公务学术与培训申请", windows: ["基本信息", "出差行程及人员信息"] }, { doctype: "国内外公务学术与培训报销", sheetname: "国内外公务学术与培训报销", windows: ["基本信息", "差旅费报销信息"] }, { doctype: "会议费申请", sheetname: "办会费申请", windows: ["基本信息", "综合费用信息", "师资费信息"] }, { doctype: "会议费报销", sheetname: "办会费报销", windows: ["基本信息", "会议综合费用", "会议师资费用"] }, { doctype: "其他劳务报销", sheetname: "其他劳务报销", windows: ["基本信息", "其他劳务报销明细"] }, { doctype: "咨询费报销", sheetname: "咨询费报销", windows: ["基本信息", "咨询费报销明细"] }, { doctype: "托儿费报销", sheetname: "托儿费报销", windows: ["基本信息", "报销明细"] }, { doctype: "人员外出进修申请", sheetname: "人员外出进修申请", windows: ["基本信息"] }, { doctype: "人员外出进修报销", sheetname: "人员外出进修报销", windows: ["人员外出进修报销", "途中信息"] }, { doctype: "宣传费申请", sheetname: "宣传费申请", windows: ["基本信息", "宣传费信息"] }, { doctype: "宣传费报销", sheetname: "宣传费报销", windows: ["基本信息", "宣传费信息"] }, { doctype: "设备付款申请", sheetname: "设备付款申请", windows: ["设备付款申请"] }, { doctype: "基建项目付款申请", sheetname: "基建项目付款申请", windows: ["基建项目付款申请"] }, { doctype: "借款申请", sheetname: "借款申请", windows: ["基本信息"] }, { doctype: "药品材料设备批量付款", sheetname: "药品材料设备批量付款", windows: ["基本信息", "付款明细"] }, { doctype: "还款申请", sheetname: "还款申请", windows: ["基本信息"] }, { doctype: "夜班费申报", sheetname: "夜班费申报", windows: ["基本信息", "夜班费明细"] }, { doctype: "夜班费汇总报销", sheetname: "夜班费汇总报销", windows: ["基本信息", "报销明细"] }, { doctype: "预算项目申报", sheetname: "预算项目申报", windows: ["预算项目立项", "项目测算表", "项目绩效目标", "分年度支出计划"] }, { doctype: "配套资金批量下达", sheetname: "配套资金批量下达", windows: ["基本信息", "下达明细"] }, { doctype: "医疗设备购置论证", sheetname: "医疗设备购置论证", windows: ["基本信息", "参考品牌", "收费信息"] }, { doctype: "预算编报一上汇总提报", sheetname: "预算编报一上汇总提报", windows: ["基本信息", "预算项目信息（汇总数据）", "绩效目标信息", "项目概况信息", "分年度支出计划", "项目测算表(单位:元)"] }, { doctype: "政府采购预算编报", sheetname: "政府采购预算编报", windows: ["基本信息", "政采预算明细", "对照编报项目（归口）", "对照编报项目（科室）"] }, { doctype: "支出预算一下批复意见", sheetname: "支出预算一下批复意见", windows: ["基本信息", "归口汇总预算项目信息", "部门编报预算项目信息", "新增项目明细信息"] }, { doctype: "新增资产配置预算", sheetname: "新增资产配置预算", windows: ["基本信息", "资产配置明细"] }, { doctype: "预算编报二下反馈", sheetname: "预算编报二下反馈", windows: ["基本信息", "预算二下信息"] }, { doctype: "预算结转", sheetname: "预算结转", windows: ["预算转结", "预算转结明细", "预算结转明细."] }, { doctype: "合同变更补充修订", sheetname: "合同变更补充修订", windows: ["基本信息", "履约条款信息", "变更补充修订历史", "合同关联采购信息", "关联新预算信息", "合同关联预算信息"] }, { doctype: "科研配套奖励资金下达", sheetname: "科研配套奖励资金下达", windows: ["基本信息", "奖励经费明细"] }, { doctype: "供应商信息变更", sheetname: "供应商信息变更", windows: ["供应商信息变更"] }, { doctype: "采购申请作废", sheetname: "采购申请作废", windows: ["采购申请作废"] }, { doctype: "可收费耗材计费审批", sheetname: "可收费耗材计费审批", windows: ["可收费耗材计费审批"] }],
        NodeUserDesList: ["科室主任", "分管业务领导", "分管财务领导", "财务主任", "主要领导", "出纳", "财务初审", "办公室主任", "业务部门负责人", "归口管理部门", "院办公会"],
        SLDutyType: 3,
        SLIcon: "ics",
        SLTitle: "内控流程体系-业务流程图",
        ServerFunctionList: { 采购管理: ["采购申请作废"], 合同管理: ["合同续签", "合同存档编号", "合同终结", "合同履约台账写入", "合同变更预算验证", "供应商信息变更", "合同履约条款金额扣除", "合同审批重冻结前验证", "合同台账写入", "合同续签单据处理", "合同修订变更补充处理"], 课题管理: ["写入预算项目维护_001课题", "课题负责人消息提示"], 物资管理: ["物资验收申请台账写入", "更新物资购置申请台账状态（减少核减数量）", "更新物资购置申请台账状态（增加核减数量）", "物资购置申请作废台账写入", "更新物资信息库存状态（修改库存状态核减）", "更新物资验收申请台账状态（归还入库状态）", "更新物资验收申请台账状态（修改入库状态）", "更新物资信息库存状态（归还库存状态核加）", "物资库存预警检测和发送告警消息", "更新物资购置申请台账状态（减少验收数量）", "物资采购计划台账写入", "物资购置申请台账写入", "计算物资领用出库总价", "更新物资购置申请台账状态（增加验收数量）"], 系统集成: ["政府会计发送数据"], 项目管理: ["项目台帐写入"], 预算管理: ["预算调整后在途单据数据", "计算课题的已报销金额", "配套资金批量下达预算写入", "增改项目同步到项目对照库_一上", "预算调整验证政府采购及信息", "增改项目同步到项目对照库_二上", "自动生成政府采购预算信息", "科研外拨资金拆分发消息给财务", "预算调整中间节点金额验证", "未提交单据预算预验证", "预算调整执行2", "预算调整判断是否勾选政府采购", "一次性预算项目资金回池", "招标采购申请预算重冻结2", "预算调整", "预算申请扣减2_程序", "申报项目写入项目对照库", "年度预算结转", "融合预算调整提交前预验证", "科研配套奖励经费下达", "年度预算下达", "合同审批预算重冻结2", "预算到账通知", "采购计划预算调整处理"], 预算申请: ["预算申请返还", "预算申请扣减2", "预算申请提交前2", "预算申请作废", "预算申请返还2", "预算申请扣减", "预算申请提交前", "预算验证提交前通用"], 预算申请支付: ["预算申请支付扣减", "预算申请支付作废", "预算申请支付返还"], 预算下达: ["写入外拨资金明细", "预算资金到账拆分_拆分时验证", "预算资金到账拆分_写入台账", "预算下达_配套资金到账分解", "预算下达_年度预算下达2", "预算下达_课题资金到账分解", "写入预算项目维护_预算下达_002规培", "写入配套资金明细", "写入下拨资金记录"], 预算支付: ["预算支付扣减", "预算申请支付扣减2", "预算申请支付提交验证2", "预算支付返还", "预算支付作废", "预算支付提交前"], 支出管理: ["分期付款台账写入", "金额信息验证", "写入借款申请台账", "事前申请台账写入", "更新借款申请台账"], 资产管理: ["更新资产变动信息", "更新资产出库状态信息", "资产盘点计划台账写入", "资产调拨更新", "更新资产累计折旧值（按月计算，直线法）", "更新资产处置状态", "资产验收入库台账写入", "资产维修申请台账写入", "更新资产维修申请台账"] },
        WorkFlowRelationList: { 分管领导: "100000000", 部门负责人: "100000001", 物资审核员: "100000002", 内部审计部主任: "100000003" },
      };
    },
  },
  {
    url: "/api/workflow/GetWorkFlowInfo",
    method: "post",
    response: () => {
      return {};
    },
  },
  {
    url: "/api/workflow/GetUserList",
    method: "post",
    response: () => {
      return {
        total: 3007,
        list: [
          { UserID: "100000001", UserCode: "0125", UserName: "邓**", Company: "山东省***", OrgName: "消化内科一病区" },
          { UserID: "100000002", UserCode: "0200", UserName: "高**", Company: "山东省***", OrgName: "消化内科一病区" },
          { UserID: "100000003", UserCode: "0267", UserName: "韩**", Company: "山东省***", OrgName: "骨软与血管外介入病区" },
          { UserID: "100000004", UserCode: "0341", UserName: "黄**", Company: "山东省***", OrgName: "消化内科三病区" },
          { UserID: "100000005", UserCode: "0555", UserName: "李**", Company: "山东省***", OrgName: "消化内科一病区" },
          { UserID: "100000006", UserCode: "0624", UserName: "刘**", Company: "山东省***", OrgName: "骨软与血管外介入病区" },
          { UserID: "100000007", UserCode: "0828", UserName: "庞**", Company: "山东省***", OrgName: "消化内科一病区" },
          { UserID: "100000008", UserCode: "1004", UserName: "谭**", Company: "山东省***", OrgName: "消化内科一病区" },
          { UserID: "100000009", UserCode: "1082", UserName: "王**", Company: "山东省***", OrgName: "消化内科一病区" },
          { UserID: "100000010", UserCode: "1289", UserName: "徐**", Company: "山东省***", OrgName: "消化内科一病区" },
          { UserID: "100000011", UserCode: "1434", UserName: "于**", Company: "山东省***", OrgName: "消化内科二病区" },
          { UserID: "100000012", UserCode: "1628", UserName: "赵**", Company: "山东省***", OrgName: "消化内科一病区" },
          { UserID: "100000013", UserCode: "1780", UserName: "徐**", Company: "山东省***", OrgName: "骨软与血管外介入病区" },
          { UserID: "100000014", UserCode: "1795", UserName: "谭**", Company: "山东省***", OrgName: "消化内科一病区" },
          { UserID: "100000015", UserCode: "1834", UserName: "王**", Company: "山东省***", OrgName: "消化内科一病区" },
          { UserID: "100000016", UserCode: "1838", UserName: "徐**", Company: "山东省***", OrgName: "中西医结合病区" },
          { UserID: "100000017", UserCode: "1936", UserName: "张**", Company: "山东省***", OrgName: "消化内科一病区" },
          { UserID: "100000018", UserCode: "1974", UserName: "韩**", Company: "山东省***", OrgName: "消化内科一病区" },
          { UserID: "100000019", UserCode: "2300", UserName: "赵**", Company: "山东省***", OrgName: "胸外科二病区" }],
      };
    },
  },
  {
    url: "/api/workflow/GetCheckFactorList",
    method: "post",
    response: () => {
      return ["出差报销-单据编号", "出差报销-单据日期", "出差报销-报销人", "出差报销-部门名称", "出差报销-单位名称", "出差报销-是否科研经费", "出差报销-报销人编号", "出差报销-部门编号", "出差报销-单位编号", "出差报销-报销金额", "出差报销-金额大写", "出差报销-附件张数", "出差报销-备注", "出差报销-申请单号", "出差报销-查看事前申请", "出差报销-申请日期", "出差报销-申请人", "出差报销-申请部门", "出差报销-申请金额", "出差报销-申请事由", "出差报销-行程信息", "出差报销-市内行程数", "出差报销-省内行程数", "出差报销-省外行程数", "出差报销-结算信息", "行程信息-出发日期", "行程信息-出发地区", "行程信息-出发城市", "行程信息-到达日期", "行程信息-到达地区", "行程信息-到达城市", "行程信息-交通工具", "行程信息-出差人员", "行程信息-交通工具编号", "行程信息-地区编号", "行程信息-到达地区编号", "行程信息-伙食补助标准", "行程信息-交通补助标准", "行程信息-人员信息", "本单位报销人员信息-姓名", "本单位报销人员信息-部门名称", "本单位报销人员信息-职级", "本单位报销人员信息-城市间交通费", "本单位报销人员信息-双人合住标间", "本单位报销人员信息-住宿标准", "本单位报销人员信息-住宿费", "本单位报销人员信息-住宿天数", "本单位报销人员信息-伙食补助标准", "本单位报销人员信息-伙食补助天数", "本单位报销人员信息-伙食补助费", "本单位报销人员信息-市内交通补助标准", "本单位报销人员信息-市内交通补助天数", "本单位报销人员信息-交通补助费", "本单位报销人员信息-其他费用", "本单位报销人员信息-合计金额", "本单位报销人员信息-行政级别编号", "外部报销人员信息-姓名", "外部报销人员信息-单位/部门", "外部报销人员信息-职级", "外部报销人员信息-城市间交通费", "外部报销人员信息-双人合住标间", "外部报销人员信息-住宿标准", "外部报销人员信息-住宿费", "外部报销人员信息-住宿天数", "外部报销人员信息-伙食补助标准", "外部报销人员信息-伙食补助天数", "外部报销人员信息-伙食补助费", "外部报销人员信息-市内交通补助标准", "外部报销人员信息-市内交通补助天数", "外部报销人员信息-交通补助费", "外部报销人员信息-其他费用", "外部报销人员信息-合计金额", "外部报销人员信息-行政级别编号", "公务卡结算-姓名", "公务卡结算-公务卡号", "公务卡结算-结算金额", "其他结算-结算方式", "其他结算-收款人", "其他结算-开户银行", "其他结算-银行账号", "其他结算-结算金额", "其他结算-结算方式编号"];
    },
  },
  {
    url: "/api/workflow/GetCheckOperationPurviewList",
    method: "post",
    response: () => {
      return ["行程信息", "本单位报销人员信息", "外部报销人员信息", "公务卡结算", "其他结算"];
    },
  },
  {
    url: "/api/workflow/SaveWorkFlow",
    method: "post",
    response: () => {
      return { Code: "S", $code: "S", Success: true, $msg: "", Message: "", Result: null, $result: null };
    },
  },
];
